bouffalolab/bouffalo_sdk/bsp/board/bl702dk/board.c
#include "bflb_uart.h"
#include "bflb_gpio.h"
#include "bflb_clock.h"
#include "bflb_rtc.h"
#include "bflb_flash.h"
#include "bflb_sec_mutex.h"
#include "bflb_spi_psram.h"
#include "hardware/sf_ctrl_reg.h"
#include "bflb_efuse.h"

#include "bl702_glb.h"
#include "ef_data_reg.h"
#include "board.h"

#include "mm.h"

extern void log_start(void);

extern uint32_t __HeapBase;
extern uint32_t __HeapLimit;
extern uint32_t __psram_heap_base;
extern uint32_t __psram_limit;

static struct bflb_device_s *uart0;

#if defined(CONFIG_BFLB_LOG)
static struct bflb_device_s *rtc;
#endif

static void system_clock_init(void)
{
    GLB_Set_System_CLK(GLB_DLL_XTAL_32M, GLB_SYS_CLK_DLL144M);
    GLB_Set_MTimer_CLK(1, GLB_MTIMER_CLK_BCLK, 71);
    HBN_Set_XCLK_CLK_Sel(HBN_XCLK_CLK_XTAL);
}

static void peripheral_clock_init(void)
{
    PERIPHERAL_CLOCK_ADC_DAC_ENABLE();
    PERIPHERAL_CLOCK_SEC_ENABLE();
    PERIPHERAL_CLOCK_DMA0_ENABLE();
    PERIPHERAL_CLOCK_UART0_ENABLE();
    PERIPHERAL_CLOCK_UART1_ENABLE();
    PERIPHERAL_CLOCK_SPI0_ENABLE();
    PERIPHERAL_CLOCK_I2C0_ENABLE();
    PERIPHERAL_CLOCK_PWM0_ENABLE();
    PERIPHERAL_CLOCK_TIMER0_1_WDG_ENABLE();
    PERIPHERAL_CLOCK_IR_ENABLE();
    PERIPHERAL_CLOCK_I2S_ENABLE();
    PERIPHERAL_CLOCK_USB_ENABLE();
    GLB_AHB_Slave1_Clock_Gate(DISABLE, BL_AHB_SLAVE1_CAM);

    GLB_Set_UART_CLK(ENABLE, HBN_UART_CLK_96M, 0);
    GLB_Set_SPI_CLK(ENABLE, 0);
    GLB_Set_I2C_CLK(ENABLE, 0);
    GLB_Set_IR_CLK(ENABLE, GLB_IR_CLK_SRC_XCLK, 15);

    GLB_Set_ADC_CLK(ENABLE, GLB_ADC_CLK_XCLK, 1);
    GLB_Set_DAC_CLK(ENABLE, GLB_DAC_CLK_XCLK, 0x3E);

    GLB_Set_USB_CLK(ENABLE);
}

/* bsp sf psram private variables */

struct spi_psram_cfg_type ap_memory1604 = {
    .read_id_cmd = 0x9F,
    .read_id_dmy_clk = 0,
    .burst_toggle_cmd = 0xC0,
    .reset_enable_cmd = 0x66,
    .reset_cmd = 0x99,
    .enter_quad_mode_cmd = 0x35,
    .exit_quad_mode_cmd = 0xF5,
    .read_reg_cmd = 0xB5,
    .read_reg_dmy_clk = 1,
    .write_reg_cmd = 0xB1,
    .read_cmd = 0x03,
    .read_dmy_clk = 0,
    .f_read_cmd = 0x0B,
    .f_read_dmy_clk = 1,
    .f_read_quad_cmd = 0xEB,
    .f_read_quad_dmy_clk = 3,
    .write_cmd = 0x02,
    .quad_write_cmd = 0x38,
    .page_size = 512,
    .ctrl_mode = PSRAM_SPI_CTRL_MODE,
    .drive_strength = PSRAM_DRIVE_STRENGTH_50_OHMS,
    .burst_length = PSRAM_BURST_LENGTH_512_BYTES,
};

struct sf_ctrl_cmds_cfg cmds_cfg = {
    .cmds_en = 1,
    .burst_toggle_en = 1,
    .cmds_wrap_mode = 0,
    .cmds_wrap_len = SF_CTRL_WRAP_LEN_512,
};
struct sf_ctrl_psram_cfg psram_cfg = {
    .owner = SF_CTRL_OWNER_SAHB,
    .pad_sel = SF_CTRL_SEL_DUAL_CS_SF2,
    .bank_sel = SF_CTRL_SEL_PSRAM,
    .psram_rx_clk_invert_src = 1,
    .psram_rx_clk_invert_sel = 0,
    .psram_delay_src = 1,
    .psram_clk_delay = 1,
};

#define BFLB_EXTFLASH_CS_GPIO    GLB_GPIO_PIN_25
#define BFLB_EXTPSRAM_CLK_GPIO   GLB_GPIO_PIN_27
#define BFLB_EXTPSRAM_CS_GPIO    GLB_GPIO_PIN_17
#define BFLB_EXTPSRAM_DATA0_GPIO GLB_GPIO_PIN_28
#define BFLB_EXTPSRAM_DATA1_GPIO GLB_GPIO_PIN_24
#define BFLB_EXTPSRAM_DATA2_GPIO GLB_GPIO_PIN_23
#define BFLB_EXTPSRAM_DATA3_GPIO GLB_GPIO_PIN_26

void ATTR_TCM_SECTION psram_gpio_init(void)
{
    GLB_GPIO_Cfg_Type cfg;
    uint8_t gpiopins[7];
    uint8_t i = 0;

    cfg.gpioMode = GPIO_MODE_AF;
    cfg.pullType = GPIO_PULL_UP;
    cfg.drive = 3;
    cfg.smtCtrl = 1;
    cfg.gpioFun = GPIO_FUN_FLASH_PSRAM;

    gpiopins[0] = BFLB_EXTPSRAM_CLK_GPIO;
    gpiopins[1] = BFLB_EXTPSRAM_CS_GPIO;
    gpiopins[2] = BFLB_EXTPSRAM_DATA0_GPIO;
    gpiopins[3] = BFLB_EXTPSRAM_DATA1_GPIO;
    gpiopins[4] = BFLB_EXTPSRAM_DATA2_GPIO;
    gpiopins[5] = BFLB_EXTPSRAM_DATA3_GPIO;
    gpiopins[6] = BFLB_EXTFLASH_CS_GPIO;

    for (i = 0; i < sizeof(gpiopins); i++) {
        cfg.gpioPin = gpiopins[i];

        if (i == 0 || i == 1 || i == 6) {
            /*flash clk and cs is output*/
            cfg.gpioMode = GPIO_MODE_OUTPUT;
        } else {
            /*data are bidir*/
            cfg.gpioMode = GPIO_MODE_AF;
        }

        GLB_GPIO_Init(&cfg);
    }
}

uint8_t psramId[8] = { 0 };

#ifdef CONFIG_PSRAM
__attribute__((noinline)) int ATTR_TCM_SECTION board_psram_init(void)
{
    bflb_efuse_device_info_type device_info;
    uint32_t sf_ctrl_0, sf_ctrl_1, sf_ctrl_2;
    uint32_t regval;
    int rst_ret, drv_ret, wrap_ret;
    uint8_t psram_id[8] = { 0 };

    bflb_efuse_get_device_info(&device_info);

    /* Snapshot the sf controller state: restored on psram init failure so
     * flash access keeps working (no driver api can save/restore these
     * registers as a whole). */
    sf_ctrl_0 = getreg32(BFLB_SF_CTRL_BASE + SF_CTRL_0_OFFSET);
    sf_ctrl_1 = getreg32(BFLB_SF_CTRL_BASE + SF_CTRL_1_OFFSET);
    sf_ctrl_2 = getreg32(BFLB_SF_CTRL_BASE + SF_CTRL_2_OFFSET);

    if (device_info.psram_info == 1) {
        psram_cfg.pad_sel = SF_CTRL_SEL_DUAL_BANK_SF2_SF3;
        psram_cfg.psram_rx_clk_invert_sel = 1;
        psram_cfg.psram_clk_delay = 0;
        GLB_Select_Internal_PSram();
    } else if (device_info.psram_info == 0) {
        psram_cfg.pad_sel = SF_CTRL_SEL_DUAL_CS_SF2;
        psram_cfg.psram_rx_clk_invert_sel = 1;
        psram_cfg.psram_clk_delay = 0;
        psram_gpio_init();
    } else {
        return -1;
    }

    bflb_sf_ctrl_psram_init(&psram_cfg);
    bflb_sf_ctrl_cmds_set(&cmds_cfg, SF_CTRL_SEL_PSRAM);

    rst_ret = bflb_psram_softwarereset(&ap_memory1604, ap_memory1604.ctrl_mode);
    bflb_psram_readid(&ap_memory1604, psram_id);
    drv_ret = bflb_psram_setdrivestrength(&ap_memory1604);
    wrap_ret = bflb_psram_setburstwrap(&ap_memory1604);

    bflb_sf_ctrl_sbus_select_bank(SF_CTRL_SEL_FLASH);

    if (rst_ret != 0 || drv_ret != 0 || wrap_ret != 0 || psram_id[0] != 0x0d) {
        putreg32(sf_ctrl_0, BFLB_SF_CTRL_BASE + SF_CTRL_0_OFFSET);
        putreg32(sf_ctrl_1, BFLB_SF_CTRL_BASE + SF_CTRL_1_OFFSET);
        /* Force the flash bank routing back regardless of the boot2 state. */
        regval = sf_ctrl_2 & ~((1U << 29) | (1U << 30) | (1U << 31));
        putreg32(regval, BFLB_SF_CTRL_BASE + SF_CTRL_2_OFFSET);
        return -1;
    }

    bflb_psram_cache_write_set(&ap_memory1604, SF_CTRL_QIO_MODE, ENABLE, DISABLE, DISABLE);
    /* Set burst toggle to spi mode, fix psram random access issue */
    putreg32(0x08000000, BFLB_SF_CTRL_BASE + 0x84);

    return 0;
}
#endif

uint32_t board_psram_size_get(void)
{
    return 2 * 1024 * 1024;
}

void bl_show_log(void)
{
    printf("\r\n");
    printf("  ____               __  __      _       _       _     \r\n");
    printf(" |  _ \\             / _|/ _|    | |     | |     | |    \r\n");
    printf(" | |_) | ___  _   _| |_| |_ __ _| | ___ | | __ _| |__  \r\n");
    printf(" |  _ < / _ \\| | | |  _|  _/ _` | |/ _ \\| |/ _` | '_ \\ \r\n");
    printf(" | |_) | (_) | |_| | | | || (_| | | (_) | | (_| | |_) |\r\n");
    printf(" |____/ \\___/ \\__,_|_| |_| \\__,_|_|\\___/|_|\\__,_|_.__/ \r\n");
    printf("\r\n");
    printf("Build:%s,%s\r\n", __TIME__, __DATE__);
    printf("Copyright (c) 2022 Bouffalolab team\r\n");
}

void bl_show_flashinfo(void)
{
    spi_flash_cfg_type flashCfg;
    uint8_t *pFlashCfg = NULL;
    uint32_t flashSize = 0;
    uint32_t flashCfgLen = 0;
    uint32_t flashJedecId = 0;

    flashJedecId = bflb_flash_get_jedec_id();
    flashSize = bflb_flash_get_size();
    bflb_flash_get_cfg(&pFlashCfg, &flashCfgLen);
    arch_memcpy((void *)&flashCfg, pFlashCfg, flashCfgLen);
    printf("======== flash cfg ========\r\n");
    printf("flash size 0x%08X\r\n", flashSize);
    printf("jedec id     0x%06X\r\n", flashJedecId);
    printf("mid              0x%02X\r\n", flashCfg.mid);
    printf("iomode           0x%02X\r\n", flashCfg.io_mode);
    printf("clk delay        0x%02X\r\n", flashCfg.clk_delay);
    printf("clk invert       0x%02X\r\n", flashCfg.clk_invert);
    printf("read reg cmd0    0x%02X\r\n", flashCfg.read_reg_cmd[0]);
    printf("read reg cmd1    0x%02X\r\n", flashCfg.read_reg_cmd[1]);
    printf("write reg cmd0   0x%02X\r\n", flashCfg.write_reg_cmd[0]);
    printf("write reg cmd1   0x%02X\r\n", flashCfg.write_reg_cmd[1]);
    printf("qe write len     0x%02X\r\n", flashCfg.qe_write_reg_len);
    printf("cread support    0x%02X\r\n", flashCfg.c_read_support);
    printf("cread code       0x%02X\r\n", flashCfg.c_read_mode);
    printf("burst wrap cmd   0x%02X\r\n", flashCfg.burst_wrap_cmd);
    printf("===========================\r\n");
}

extern void bflb_uart_set_console(struct bflb_device_s *dev);

static void console_init()
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    bflb_gpio_uart_init(gpio, GPIO_PIN_14, GPIO_UART_FUNC_UART0_TX);
    bflb_gpio_uart_init(gpio, GPIO_PIN_15, GPIO_UART_FUNC_UART0_RX);

    struct bflb_uart_config_s cfg;
    cfg.baudrate = CONFIG_CONSOLE_UART_BAUDRATE;
    cfg.data_bits = UART_DATA_BITS_8;
    cfg.stop_bits = UART_STOP_BITS_1;
    cfg.parity = UART_PARITY_NONE;
    cfg.flow_ctrl = 0;
    cfg.tx_fifo_threshold = 15;
    cfg.rx_fifo_threshold = 15;

    uart0 = bflb_device_get_by_name("uart0");

    bflb_uart_init(uart0, &cfg);
    bflb_uart_set_console(uart0);
}

void board_recovery(void)
{
    system_clock_init();
    peripheral_clock_init();
    console_init();
}

void ram_heap_init(void)
{
    static const uint32_t any_alloc_order[] = {
        MM_HEAP_OCRAM_0,
        MM_HEAP_PSRAM_0,
    };
    size_t heap_len;

    /* ram heap init */
    mem_manager_init();

    /* ocram heap init */
    heap_len = ((size_t)&__HeapLimit - (size_t)&__HeapBase);
    mm_register_heap(MM_HEAP_OCRAM_0, "OCRAM", MM_ALLOCATOR_TLSF, &__HeapBase, heap_len);

#ifdef CONFIG_PSRAM
    if (board_psram_init() != 0) {
        printf("psram init failed\r\n");
        while (1) {}
    }

    heap_len = (size_t)&__psram_limit - (size_t)&__psram_heap_base;
    mm_register_heap(MM_HEAP_PSRAM_0, "PSRAM", MM_ALLOCATOR_TLSF, &__psram_heap_base, heap_len);

    /* ram info dump */
    printf("dynamic memory init success\r\n"
           "  ocram heap size: %d Kbyte, \r\n"
           "  psram heap size: %d Kbyte\r\n",
           ((size_t)&__HeapLimit - (size_t)&__HeapBase) / 1024,
           ((size_t)&__psram_limit - (size_t)&__psram_heap_base) / 1024);
#else
    /* ram info dump */
    printf("dynamic memory init success\r\n"
           "  ocram heap size: %d Kbyte \r\n",
           ((size_t)&__HeapLimit - (size_t)&__HeapBase) / 1024);
#endif

    mm_heap_set_any_alloc_order(any_alloc_order, sizeof(any_alloc_order) / sizeof(any_alloc_order[0]));
}

enum bflb_rtc_32k_clk_type board_get_rtc_32k_clk_type(void)
{
    return BFLB_RTC_32K_CLK_RC;
}

void board_init(void)
{
    int ret = -1;
    uintptr_t flag;

    flag = bflb_irq_save();

    ret = bflb_flash_init();

    system_clock_init();
    bflb_rtc_init(NULL, board_get_rtc_32k_clk_type());
    peripheral_clock_init();
    bflb_irq_initialize();

    console_init();

    /* heap init */
    ram_heap_init();

#ifndef CONFIG_BOARD_SHOW_LOG_DISABLE
    bl_show_log();
#endif
    if (ret != 0) {
        printf("flash init fail!!!\r\n");
    }
    bl_show_flashinfo();

    printf("cgen1:%08x\r\n", getreg32(BFLB_GLB_CGEN1_BASE));

    log_start();
#if defined(CONFIG_BFLB_LOG)
    rtc = bflb_device_get_by_name("rtc");
#endif

    bflb_sec_mutex_init();

    bflb_irq_restore(flag);

    printf("board init done\r\n");
    printf("===========================\r\n");
}

void board_uartx_gpio_init()
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    bflb_gpio_uart_init(gpio, GPIO_PIN_18, GPIO_UART_FUNC_UART1_TX);
    bflb_gpio_uart_init(gpio, GPIO_PIN_19, GPIO_UART_FUNC_UART1_RX);
}

void board_i2c0_gpio_init()
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    /* I2C0_SDA */
    bflb_gpio_init(gpio, GPIO_PIN_11, GPIO_FUNC_I2C0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    /* I2C0_SCL */
    bflb_gpio_init(gpio, GPIO_PIN_16, GPIO_FUNC_I2C0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
}

void board_spi0_gpio_init()
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    /* spi clk */
    bflb_gpio_init(gpio, GPIO_PIN_18, GPIO_FUNC_SPI0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    /* spi miso */
    bflb_gpio_init(gpio, GPIO_PIN_19, GPIO_FUNC_SPI0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    /* spi mosi */
    bflb_gpio_init(gpio, GPIO_PIN_20, GPIO_FUNC_SPI0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
}

void board_pwm_gpio_init()
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    bflb_gpio_init(gpio, GPIO_PIN_0, GPIO_FUNC_PWM0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_1, GPIO_FUNC_PWM0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_2, GPIO_FUNC_PWM0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_3, GPIO_FUNC_PWM0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_4, GPIO_FUNC_PWM0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
}

void board_ir_gpio_init(void)
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    /* IR TX support GPIO 22 or GPIO 23 */
    bflb_gpio_init(gpio, GPIO_PIN_22, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);
    GLB_IR_LED_Driver_Output_Disable(GLB_GPIO_PIN_23);
    GLB_IR_LED_Driver_Output_Enable(GLB_GPIO_PIN_22);

    /* IR RX support GPIO 17 ~ GPIO 31 */
    bflb_gpio_init(gpio, GPIO_PIN_18, GPIO_INPUT | GPIO_SMT_EN | GPIO_DRV_0);
    GLB_IR_RX_GPIO_Sel(GLB_GPIO_PIN_18);
}

void board_adc_gpio_init()
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    bflb_gpio_init(gpio, GPIO_PIN_18, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);
    bflb_gpio_init(gpio, GPIO_PIN_19, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);
    bflb_gpio_init(gpio, GPIO_PIN_20, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);
}

void board_dac_gpio_init()
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    /* DAC_CHA */
    bflb_gpio_init(gpio, GPIO_PIN_11, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);
    /* DAC_CHB */
    bflb_gpio_init(gpio, GPIO_PIN_17, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);
}

void board_dac_ref_gpio_init()
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    /* DAC_REF */
    bflb_gpio_init(gpio, GPIO_PIN_7, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);
}

void board_emac_rmii_gpio_init(uint8_t port)
{
    struct bflb_device_s *gpio;

    if (port != 0) {
        return;
    }

    gpio = bflb_device_get_by_name("gpio");
    bflb_gpio_init(gpio, GPIO_PIN_0, GPIO_FUNC_EMAC | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_1, GPIO_FUNC_EMAC | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_2, GPIO_FUNC_EMAC | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_7, GPIO_FUNC_EMAC | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_8, GPIO_FUNC_EMAC | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_20, GPIO_FUNC_EMAC | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_21, GPIO_FUNC_EMAC | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_22, GPIO_FUNC_EMAC | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);

    /* enable audio clock */
    PDS_Enable_PLL_Clk(PDS_PLL_CLK_48M);
    PDS_Set_Audio_PLL_Freq(AUDIO_PLL_50000000_HZ);
}

void board_emac_mdio_gpio_init(uint8_t port)
{
    struct bflb_device_s *gpio;

    if (port != 0) {
        return;
    }

    gpio = bflb_device_get_by_name("gpio");
    bflb_gpio_init(gpio, GPIO_PIN_18, GPIO_FUNC_EMAC | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_19, GPIO_FUNC_EMAC | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
}

void board_keyscan_gpio_init(void)
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    bflb_gpio_init(gpio, GPIO_PIN_0,
                   GPIO_FUN_KEY_SCAN_COL | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_OUTPUT | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_1,
                   GPIO_FUN_KEY_SCAN_COL | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_OUTPUT | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_2,
                   GPIO_FUN_KEY_SCAN_COL | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_OUTPUT | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_3,
                   GPIO_FUN_KEY_SCAN_COL | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_OUTPUT | GPIO_SMT_EN | GPIO_DRV_1);

    bflb_gpio_init(gpio, GPIO_PIN_16,
                   GPIO_FUN_KEY_SCAN_ROW | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_INPUT | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_17,
                   GPIO_FUN_KEY_SCAN_ROW | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_INPUT | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_18,
                   GPIO_FUN_KEY_SCAN_ROW | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_INPUT | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_19,
                   GPIO_FUN_KEY_SCAN_ROW | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_INPUT | GPIO_SMT_EN | GPIO_DRV_1);

    GLB_Set_QDEC_CLK(GLB_QDEC_CLK_F32K, 0);
}

void board_dvp_gpio_init(void)
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    /* I2C GPIO */
    bflb_gpio_init(gpio, GPIO_PIN_16, GPIO_FUNC_I2C0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_11, GPIO_FUNC_I2C0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);

    /* MCLK, use GPIO 10 */
    //bflb_gpio_init(gpio, GPIO_PIN_10, GPIO_FUNC_CAM_MCLK | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    //GLB_Set_CAM_CLK(ENABLE, GLB_CAM_CLK_DLL96M, 3);

    /* MCLK, use GPIO 9 */
    bflb_gpio_init(gpio, GPIO_PIN_9, GPIO_FUNC_CLK_OUT | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    PDS_Set_Audio_PLL_Freq(AUDIO_PLL_24576000_HZ);
    GLB_Set_Chip_Out_1_CLK_Sel(GLB_CHIP_CLK_OUT_I2S_REF_CLK);

    /* DVP GPIO */
    bflb_gpio_init(gpio, GPIO_PIN_0, GPIO_FUNC_CAM | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_1, GPIO_FUNC_CAM | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_2, GPIO_FUNC_CAM | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_3, GPIO_FUNC_CAM | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_4, GPIO_FUNC_CAM | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_5, GPIO_FUNC_CAM | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_6, GPIO_FUNC_CAM | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_12, GPIO_FUNC_CAM | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_29, GPIO_FUNC_CAM | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_30, GPIO_FUNC_CAM | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
    bflb_gpio_init(gpio, GPIO_PIN_31, GPIO_FUNC_CAM | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);

    GLB_SWAP_EMAC_CAM_Pin(GLB_EMAC_CAM_PIN_CAM);
}

#if defined(CONFIG_BSP_LCD)

void board_lcd_spi_0_hard_4_gpio_init(void)
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    /* LCD_SPI_DAT */
    bflb_gpio_init(gpio, GPIO_PIN_15, GPIO_FUNC_SPI0 | GPIO_ALTERNATE | GPIO_PULLDOWN | GPIO_SMT_EN | GPIO_DRV_1);
    /* LCD_SPI_CLK */
    bflb_gpio_init(gpio, GPIO_PIN_17, GPIO_FUNC_SPI0 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
}

#if defined(GPIO_FUNC_SPI1)
void board_lcd_spi_1_hard_4_gpio_init(void)
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    /* LCD_SPI_DAT */
    bflb_gpio_init(gpio, GPIO_PIN_15, GPIO_FUNC_SPI1 | GPIO_ALTERNATE | GPIO_PULLDOWN | GPIO_SMT_EN | GPIO_DRV_1);
    /* LCD_SPI_CLK */
    bflb_gpio_init(gpio, GPIO_PIN_17, GPIO_FUNC_SPI1 | GPIO_ALTERNATE | GPIO_PULLUP | GPIO_SMT_EN | GPIO_DRV_1);
}
#endif
#endif

#if (defined CFG_BLUETOOTH_ENABLED) || (defined CFG_M154_ENABLED)
void rf_full_cal_start_callback(uint32_t addr, uint32_t size)
{
    /** TBD: need to check memory access conflict on DMA and rf calculation*/
}
#endif

#ifdef CONFIG_SHELL
#ifdef CONFIG_PM
#include "shell.h"
#include "bl_lp.h"
#include "bflb_acomp.h"

static void test_acomp_wakeup_status(uint8_t acomp_num)
{
    int wakeup_mode;

    wakeup_mode = bl_lp_wakeup_acomp_get_mode(acomp_num);

    if (wakeup_mode) {
        printf("ACOMP %d wakeup: ", acomp_num);
        if (wakeup_mode == BL_LP_ACOMP_WAKEUP_MODE_FALLING) {
            printf("edge falling\r\n");
        } else if (wakeup_mode == BL_LP_ACOMP_WAKEUP_MODE_RISING) {
            printf("edge rising\r\n");
        } else {
            printf("unkown error: %d\r\n", wakeup_mode);
        }
    }
}

void test_wakeup_acomp_callback(uint32_t wake_up_acomp_bits)
{
    printf("acomp wakeup bits 0x%02X\r\n", wake_up_acomp_bits);

    for (uint8_t i = 0; i < BL_LP_WAKEUP_ACOMP_MAX_NUM; i++) {
        test_acomp_wakeup_status(i);
    }
}

void cmd_acomp_test(char *buf, int len, int argc, char **argv)
{
    static bl_lp_acomp_cfg_t lp_wake_acomp_cfg = {
        /* input enable, use @ref BL_LP_ACOMP_EN */
        .acomp0_en = BL_LP_ACOMP_ENABLE,
        .acomp1_en = BL_LP_ACOMP_DISABLE,

        /* Map to pins num, 702's range: 7, 8, 9, 10, 14, 15, 17 */
        .acomp0_io_num = 17,
        .acomp1_io_num = 0,

        /* trigger mode, use @ref BL_LP_ACOMP_TRIG  */
        .acomp0_trig_mode = BL_LP_ACOMP_TRIG_EDGE_FALLING_RISING,
        .acomp1_trig_mode = BL_LP_ACOMP_TRIG_EDGE_FALLING_RISING,
    };

    bl_lp_acomp_wakeup_cfg(&lp_wake_acomp_cfg);

    /* register acomp wakeup callback */
    bl_lp_wakeup_acomp_int_register(test_wakeup_acomp_callback);
}
SHELL_CMD_EXPORT_ALIAS(cmd_acomp_test, acomp_test, acomp_test);
#endif
#endif

#ifdef CONFIG_BFLB_LOG
__attribute__((weak)) uint64_t bflb_log_clock(void)
{
    return bflb_mtimer_get_time_us();
}

__attribute__((weak)) uint32_t bflb_log_time(void)
{
    return BFLB_RTC_TIME2SEC(bflb_rtc_get_time(rtc));
}

__attribute__((weak)) char *bflb_log_thread(void)
{
    return "";
}
#endif
